PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_crypto_core_poly1305.c
/***************************************************************************//**
* \file cy_crypto_core_poly1305.c
* \version 2.150
*
* \brief
*  This file provides the source code to the API for the poly1305 method
*  in the Crypto block driver.
*
********************************************************************************
* \copyright
* Copyright (c) 2022-2024, Cypress Semiconductor Corporation (an Infineon company) or
* an affiliate of Cypress Semiconductor Corporation.
* SPDX-License-Identifier: Apache-2.0
*
* Licensed under the Apache License, Version 2.0 (the "License");
* you may not use this file except in compliance with the License.
* You may obtain a copy of the License at
*
*    http://www.apache.org/licenses/LICENSE-2.0
*
* Unless required by applicable law or agreed to in writing, software
* distributed under the License is distributed on an "AS IS" BASIS,
* WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
* See the License for the specific language governing permissions and
* limitations under the License.
*******************************************************************************/


#include "cy_device.h"

#if defined (CY_IP_MXCRYPTO)

#include "cy_crypto_core_poly1305.h"

#if defined(__cplusplus)
extern "C" {
#endif

#if (CPUSS_CRYPTO_VU == 1) && defined(CY_CRYPTO_CFG_POLY1305_ENABLED)

#include "cy_crypto_core_hw_v2.h"
#include "cy_crypto_core_vu.h"
#include "cy_crypto_core_mem_v2.h"

#define MIN( x, y ) ( ( x ) < ( y ) ? ( x ) : ( y ) )


#define POLY_1305_S_VREG (0u) // 130-bit state S
#define POLY_1305_M_VREG (1u) // 129-bit message M
#define POLY_1305_R_VREG (2u) // 128-bit key R
#define POLY_1305_K_VREG (3u) // 128-bit key K
#define POLY_1305_P_VREG (4u) // 130-bit prime P

#define POLY_1305_T_259_VREG (5u)
#define POLY_1305_T_132_VREG (6u)
#define POLY_1305_T_5_VREG (7u)
#define POLY_1305_C_5_VREG (8u)
#define POLY_1305_C_130_VREG (9u)



/*******************************************************************************
* Function Name: Cy_Crypto_Core_V2_poly_1305_load_ctx
****************************************************************************//**
*
* The function that loads context to internal memory for poly 1305 mac operation.
*
* \param base
* The pointer to the CRYPTO instance.
*
* \param state
* The pointer to the poly 1305 state.
*
* \return status code. See \ref cy_en_crypto_status_t.
*******************************************************************************/
static cy_en_crypto_status_t Cy_Crypto_Core_V2_poly_1305_load_ctx(CRYPTO_Type *base, cy_stc_crypto_poly_1305_state_t *state)
{
    uint32_t destAddr = 0u;
    cy_en_crypto_status_t tmpResult = CY_CRYPTO_BAD_PARAMS;

    uint8_t *stateRemap;
    uint8_t *keyRemap;

    static const uint8_t  polynomial[CY_CRYPTO_POLY1305_POLYNOMIAL_SIZE] =
    {
        0xfbu, 0xffu, 0xffu, 0xffu, 0xffu, 0xffu, 0xffu, 0xffu,
        0xffu, 0xffu, 0xffu, 0xffu, 0xffu, 0xffu, 0xffu, 0xffu,
        0x03u
    };

    static const uint8_t constant_5[] = { 0x05u };


#if (((CY_CPU_CORTEX_M7) && defined (ENABLE_CM7_DATA_CACHE)) || CY_CPU_CORTEX_M55)
    /* Flush the cache */
    SCB_CleanDCache_by_Addr((volatile void *)state->state, (int32_t)CY_CRYPTO_POLY1305_STATE_SIZE);
    SCB_CleanDCache_by_Addr((volatile void *)state->key, (int32_t)CY_CRYPTO_POLY1305_KEY_SIZE);
#endif

    stateRemap = (uint8_t *)CY_REMAP_ADDRESS_FOR_CRYPTO(state->state);
    keyRemap = (uint8_t *)CY_REMAP_ADDRESS_FOR_CRYPTO(state->key);

    tmpResult = CY_CRYPTO_VU_ALLOC_MEM(base, POLY_1305_S_VREG, 130u);
    if (CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    }

    tmpResult = CY_CRYPTO_VU_ALLOC_MEM(base, POLY_1305_M_VREG, 129u);
    if (CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    }

    tmpResult = CY_CRYPTO_VU_ALLOC_MEM(base, POLY_1305_R_VREG, 128u);
    if (CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    }

    tmpResult = CY_CRYPTO_VU_ALLOC_MEM(base, POLY_1305_K_VREG, 128u);
    if (CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    }

    tmpResult = CY_CRYPTO_VU_ALLOC_MEM(base, POLY_1305_P_VREG, 130u);
    if (CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    }

    tmpResult = CY_CRYPTO_VU_ALLOC_MEM(base, POLY_1305_T_259_VREG, 259u);
    if (CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    }

    tmpResult = CY_CRYPTO_VU_ALLOC_MEM(base, POLY_1305_T_132_VREG, 132u);
    if (CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    }

    tmpResult = CY_CRYPTO_VU_ALLOC_MEM(base, POLY_1305_T_5_VREG, 5u);
    if (CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    }

    tmpResult = CY_CRYPTO_VU_ALLOC_MEM(base, POLY_1305_C_5_VREG, 3u);
    if (CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    }

    tmpResult = CY_CRYPTO_VU_ALLOC_MEM(base, POLY_1305_C_130_VREG, 130u);
    if (CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    }

    CY_CRYPTO_VU_SET_REG(base, POLY_1305_C_130_VREG, 130u, 1u);

    // Loading the R part of the Key from context to the internal Vu register
    destAddr = (uint32_t)Cy_Crypto_Core_Vu_RegMemPointer(base, POLY_1305_R_VREG);
    Cy_Crypto_Core_V2_FFContinue(base, CY_CRYPTO_V2_RB_FF_LOAD0, keyRemap, CY_CRYPTO_POLY1305_KEY_SIZE);
    Cy_Crypto_Core_V2_FFStart(base, CY_CRYPTO_V2_RB_FF_STORE, (uint8_t*)destAddr, 16u);
    Cy_Crypto_Core_V2_BlockMov(base, CY_CRYPTO_V2_RB_FF_STORE, CY_CRYPTO_V2_RB_FF_LOAD0, 16u);

    // Loading the K part of the Key from context to the internal Vu register
    destAddr = (uint32_t)Cy_Crypto_Core_Vu_RegMemPointer(base, POLY_1305_K_VREG);
    Cy_Crypto_Core_V2_FFStart(base, CY_CRYPTO_V2_RB_FF_STORE, (uint8_t*) destAddr, 16u);
    Cy_Crypto_Core_V2_BlockMov(base, CY_CRYPTO_V2_RB_FF_STORE, CY_CRYPTO_V2_RB_FF_LOAD0, 16u);

    // Loading the prime polynomial to the internal Vu register
    destAddr = (uint32_t)Cy_Crypto_Core_Vu_RegMemPointer(base, POLY_1305_P_VREG);
    Cy_Crypto_Core_V2_FFContinue(base, CY_CRYPTO_V2_RB_FF_LOAD0, (const uint8_t*)CY_REMAP_ADDRESS_FOR_CRYPTO(polynomial), CY_CRYPTO_POLY1305_POLYNOMIAL_SIZE);
    Cy_Crypto_Core_V2_FFStart(base, CY_CRYPTO_V2_RB_FF_STORE, (uint8_t*)destAddr, CY_CRYPTO_POLY1305_POLYNOMIAL_SIZE);
    Cy_Crypto_Core_V2_BlockMov(base, CY_CRYPTO_V2_RB_FF_STORE, CY_CRYPTO_V2_RB_FF_LOAD0, 16u);
    Cy_Crypto_Core_V2_BlockMov(base, CY_CRYPTO_V2_RB_FF_STORE, CY_CRYPTO_V2_RB_FF_LOAD0, 1u);

    // Loading Constant to the internal Vu register
    destAddr = (uint32_t)Cy_Crypto_Core_Vu_RegMemPointer(base, POLY_1305_C_5_VREG);
    Cy_Crypto_Core_V2_FFContinue(base, CY_CRYPTO_V2_RB_FF_LOAD0, (const uint8_t*)CY_REMAP_ADDRESS_FOR_CRYPTO(constant_5), 1u);
    Cy_Crypto_Core_V2_FFStart(base, CY_CRYPTO_V2_RB_FF_STORE, (uint8_t*)destAddr, 1u);
    Cy_Crypto_Core_V2_BlockMov(base, CY_CRYPTO_V2_RB_FF_STORE, CY_CRYPTO_V2_RB_FF_LOAD0, 1u);

    // Loading the poly_1305 state from context to the internal Vu register
    destAddr = (uint32_t)Cy_Crypto_Core_Vu_RegMemPointer(base, POLY_1305_S_VREG);
    Cy_Crypto_Core_V2_FFContinue(base, CY_CRYPTO_V2_RB_FF_LOAD0, stateRemap, CY_CRYPTO_POLY1305_STATE_SIZE);
    Cy_Crypto_Core_V2_FFStart(base, CY_CRYPTO_V2_RB_FF_STORE, (uint8_t*)destAddr, CY_CRYPTO_POLY1305_STATE_SIZE);
    Cy_Crypto_Core_V2_BlockMov(base, CY_CRYPTO_V2_RB_FF_STORE, CY_CRYPTO_V2_RB_FF_LOAD0, 16u);
    Cy_Crypto_Core_V2_BlockMov(base, CY_CRYPTO_V2_RB_FF_STORE, CY_CRYPTO_V2_RB_FF_LOAD0, 1u);


