PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_crypto_core_poly1305.c
    return CY_CRYPTO_SUCCESS;

}




/*******************************************************************************
* Function Name: Cy_Crypto_Core_V2_poly_1305_store_ctx
****************************************************************************//**
*
* The function to save context from internal memory for poly 1305 mac operation.
*
* \param base
* The pointer to the CRYPTO instance.
*
* \param state
* The pointer to the poly 1305 state.
*
*******************************************************************************/
static void Cy_Crypto_Core_V2_poly_1305_store_ctx(CRYPTO_Type *base, cy_stc_crypto_poly_1305_state_t *state)
{
    uint32_t destAddr = 0u;
    uint8_t *stateRemap;


    stateRemap = (uint8_t *)CY_REMAP_ADDRESS_FOR_CRYPTO(state->state);

    // Storing the poly 1305 state from the internal VU memory to the context
    destAddr = (uint32_t)Cy_Crypto_Core_Vu_RegMemPointer(base, POLY_1305_S_VREG);
    Cy_Crypto_Core_V2_FFStart(base, CY_CRYPTO_V2_RB_FF_LOAD0, (uint8_t*)destAddr, CY_CRYPTO_POLY1305_STATE_SIZE);
    Cy_Crypto_Core_V2_FFStart(base, CY_CRYPTO_V2_RB_FF_STORE, (uint8_t*)stateRemap, CY_CRYPTO_POLY1305_STATE_SIZE);
    Cy_Crypto_Core_V2_BlockMov(base, CY_CRYPTO_V2_RB_FF_STORE, CY_CRYPTO_V2_RB_FF_LOAD0, 16u);
    Cy_Crypto_Core_V2_BlockMov(base, CY_CRYPTO_V2_RB_FF_STORE, CY_CRYPTO_V2_RB_FF_LOAD0, 1u);

    // Freeing the allocated memory from the internal VU register
    CY_CRYPTO_VU_FREE_MEM(base, CY_CRYPTO_VU_REG_BIT(POLY_1305_S_VREG) | CY_CRYPTO_VU_REG_BIT(POLY_1305_M_VREG) |
                          CY_CRYPTO_VU_REG_BIT(POLY_1305_R_VREG) | CY_CRYPTO_VU_REG_BIT(POLY_1305_K_VREG) | CY_CRYPTO_VU_REG_BIT(POLY_1305_P_VREG) |
                          CY_CRYPTO_VU_REG_BIT(POLY_1305_T_259_VREG) | CY_CRYPTO_VU_REG_BIT(POLY_1305_T_132_VREG) | CY_CRYPTO_VU_REG_BIT(POLY_1305_T_5_VREG) |
                          CY_CRYPTO_VU_REG_BIT(POLY_1305_C_5_VREG) | CY_CRYPTO_VU_REG_BIT(POLY_1305_C_130_VREG));

#if (((CY_CPU_CORTEX_M7) && defined (ENABLE_CM7_DATA_CACHE)) || CY_CPU_CORTEX_M55)
    /* Flush the cache */
    SCB_InvalidateDCache_by_Addr((volatile void *)state->state, (int32_t)CY_CRYPTO_POLY1305_STATE_SIZE);
#endif

}




/*******************************************************************************
* Function Name: Cy_Crypto_Core_V2_poly_1305_calculate
****************************************************************************//**
*
* The function to calculate poly 1305 mac.
*
* \param base
* The pointer to the CRYPTO instance.
*
* \param state
* The pointer to the poly 1305 state.
*
* \param p_message
* The pointer to the message.
*
* \param size
* The length of the message.
*
*******************************************************************************/
static void Cy_Crypto_Core_V2_poly_1305_calculate(CRYPTO_Type *base,  uint8_t * p_message,  uint32_t size)
{

    uint32_t load_size;
    uint32_t destAddr ;
    uint8_t *p_messageRemap;

#if (((CY_CPU_CORTEX_M7) && defined (ENABLE_CM7_DATA_CACHE)) || CY_CPU_CORTEX_M55)
    /* Flush the cache */
    SCB_CleanDCache_by_Addr((volatile void *)p_message, (int32_t)size);
#endif

    p_messageRemap = (uint8_t *)CY_REMAP_ADDRESS_FOR_CRYPTO(p_message);

    while (size != 0u)
    {
        load_size = MIN(size, CY_CRYPTO_POLY1305_BLOCK_SIZE);

        if (load_size == CY_CRYPTO_POLY1305_BLOCK_SIZE)
        {
            CY_CRYPTO_VU_SET_BIT_IMM(base, POLY_1305_M_VREG, 128u);

        }
        else
        {
            CY_CRYPTO_VU_SET_TO_ZERO(base, POLY_1305_M_VREG);

        }

        Cy_Crypto_Core_V2_FFContinue(base, CY_CRYPTO_V2_RB_FF_LOAD0, p_messageRemap, load_size);


        p_messageRemap += load_size;
        size      -= load_size;


        destAddr = (uint32_t)Cy_Crypto_Core_Vu_RegMemPointer(base, POLY_1305_M_VREG);
        Cy_Crypto_Core_V2_FFStart(base, CY_CRYPTO_V2_RB_FF_STORE, (uint8_t*) destAddr, load_size);
        Cy_Crypto_Core_V2_BlockMov(base, CY_CRYPTO_V2_RB_FF_STORE, CY_CRYPTO_V2_RB_FF_LOAD0, load_size);  // M

        if (load_size < CY_CRYPTO_POLY1305_BLOCK_SIZE)
        {
            CY_CRYPTO_VU_SET_BIT_IMM(base, POLY_1305_M_VREG, load_size * 8u);

        }


        CY_CRYPTO_VU_ADD(base, POLY_1305_T_132_VREG, POLY_1305_S_VREG, POLY_1305_M_VREG);
        CY_CRYPTO_VU_UMUL(base, POLY_1305_T_259_VREG, POLY_1305_T_132_VREG, POLY_1305_R_VREG);

        CY_CRYPTO_VU_LSR(base, POLY_1305_T_132_VREG, POLY_1305_T_259_VREG, POLY_1305_C_130_VREG);
        CY_CRYPTO_VU_UMUL(base, POLY_1305_T_132_VREG, POLY_1305_T_132_VREG, POLY_1305_C_5_VREG);
        CY_CRYPTO_VU_MOV(base, POLY_1305_S_VREG, POLY_1305_T_259_VREG);
        CY_CRYPTO_VU_ADD(base, POLY_1305_T_132_VREG, POLY_1305_T_132_VREG, POLY_1305_S_VREG);

        CY_CRYPTO_VU_LSR(base, POLY_1305_T_5_VREG, POLY_1305_T_132_VREG, POLY_1305_C_130_VREG);
        CY_CRYPTO_VU_UMUL(base, POLY_1305_T_5_VREG, POLY_1305_T_5_VREG, POLY_1305_C_5_VREG);
        CY_CRYPTO_VU_ADD(base, POLY_1305_S_VREG, POLY_1305_T_132_VREG, POLY_1305_T_5_VREG);

        CY_CRYPTO_VU_COND_SUB(base, CY_CRYPTO_VU_COND_CS, POLY_1305_S_VREG, POLY_1305_S_VREG, POLY_1305_P_VREG);

    }

}


/*******************************************************************************
* Function Name: Cy_Crypto_Core_poly_1305_Init
****************************************************************************//**
*
* The function to initialize poly 1305 operation.
*
* \param base
* The pointer to the CRYPTO instance.
*
* \param key
* The pointer to the key.
*
* \param state
* The pointer to the poly 1305 state.
*
* \param buffer
* The pointer to the poly 1305 buffer.
*
*
* \return
* \ref cy_en_crypto_status_t
*******************************************************************************/
cy_en_crypto_status_t Cy_Crypto_Core_poly_1305_Init(CRYPTO_Type *base, uint8_t const *key, cy_stc_crypto_poly_1305_state_t *state, cy_stc_crypto_poly_1305_buffers_t *buffer)
{

    cy_en_crypto_status_t tmpResult = CY_CRYPTO_BAD_PARAMS;
    uint8_t *keyRemap;
    uint8_t *keyInRemap;
    cy_stc_crypto_poly_1305_buffers_t *bufferRemap;

    if ((NULL != key) && (NULL != state) && (NULL != buffer))
    {
        keyInRemap = (uint8_t *)CY_REMAP_ADDRESS_FOR_CRYPTO(key);
        keyRemap = (uint8_t *)CY_REMAP_ADDRESS_FOR_CRYPTO(buffer->key);
        bufferRemap = (cy_stc_crypto_poly_1305_buffers_t *)CY_REMAP_ADDRESS_FOR_CRYPTO(buffer);

        Cy_Crypto_Core_V2_MemSet(base, bufferRemap, 0u, (uint16_t)sizeof(cy_stc_crypto_poly_1305_buffers_t));
        Cy_Crypto_Core_V2_MemCpy(base, keyRemap, (void *)keyInRemap, CY_CRYPTO_POLY1305_KEY_SIZE);

        state->state = buffer->state;
        state->key = buffer->key;
        state->partialMessage = buffer->partialMessage;
        state->messageIndex = 0u;

        state->key[3u] &= 0x0fu;
        state->key[7u] &= 0x0fu;
        state->key[11u] &= 0x0fu;
        state->key[15u] &= 0x0fu;
        state->key[4u] &= 0xfcu;
        state->key[8u] &= 0xfcu;
        state->key[12u] &= 0xfcu;

#if (((CY_CPU_CORTEX_M7) && defined (ENABLE_CM7_DATA_CACHE)) || CY_CPU_CORTEX_M55)
        /* Flush the cache */
        SCB_CleanDCache_by_Addr((volatile void *)state->key, (int32_t)CY_CRYPTO_POLY1305_KEY_SIZE);

        SCB_InvalidateDCache_by_Addr((volatile void *)buffer, (int32_t)sizeof(cy_stc_crypto_poly_1305_buffers_t));
#endif

        tmpResult = CY_CRYPTO_SUCCESS;
    }

