PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_crypto_core_poly1305.c
    return tmpResult;
}




/*******************************************************************************
* Function Name: Cy_Crypto_Core_poly_1305_Update
****************************************************************************//**
*
* The function to perform poly 1305 update.
*
* \param base
* The pointer to the CRYPTO instance.
*
* \param state
* The pointer to the poly 1305 state.
*
* \param p_message
* The pointer to the message.
*
* \param size
* The length of the message.
*
* \return
* \ref cy_en_crypto_status_t
*******************************************************************************/

cy_en_crypto_status_t Cy_Crypto_Core_poly_1305_Update(CRYPTO_Type *base, cy_stc_crypto_poly_1305_state_t *state, uint8_t const * p_message, uint32_t size)
{


    uint32_t copy_size = 0u;
    uint32_t block_count = 0u;
    cy_en_crypto_status_t tmpResult = CY_CRYPTO_SUCCESS;
    uint8_t *p_messageRemap;
    uint8_t *partialMessageRemap;

    if ((NULL == state) || (NULL == p_message))
    {
        tmpResult = CY_CRYPTO_BAD_PARAMS;
    }

    if ((tmpResult == CY_CRYPTO_SUCCESS) && (size > 0UL))
    {

#if (((CY_CPU_CORTEX_M7) && defined (ENABLE_CM7_DATA_CACHE)) || CY_CPU_CORTEX_M55)
        /* Flush the cache */
        SCB_CleanDCache_by_Addr((volatile void *)p_message, (int32_t)CY_CRYPTO_POLY1305_BLOCK_SIZE);
        SCB_CleanDCache_by_Addr((volatile void *)state->partialMessage, (int32_t)CY_CRYPTO_POLY1305_BLOCK_SIZE);
#endif

        p_messageRemap = (uint8_t *)CY_REMAP_ADDRESS_FOR_CRYPTO(p_message);
        partialMessageRemap = (uint8_t *)CY_REMAP_ADDRESS_FOR_CRYPTO(state->partialMessage);

        tmpResult = Cy_Crypto_Core_V2_poly_1305_load_ctx(base, state);
        if (CY_CRYPTO_SUCCESS != tmpResult)
        {
            return tmpResult;
        }

        if (state->messageIndex + size < CY_CRYPTO_POLY1305_BLOCK_SIZE)
        {
            Cy_Crypto_Core_V2_MemCpy(base, (void*)&partialMessageRemap[state->messageIndex], (void*)p_messageRemap, (uint16_t)size);
            state->messageIndex += size;
        }

        else
        {

            if (state->messageIndex != 0u)
            {
                copy_size = CY_CRYPTO_POLY1305_BLOCK_SIZE - state->messageIndex;
                Cy_Crypto_Core_V2_MemCpy(base, (void*)&partialMessageRemap[state->messageIndex], (void*)p_messageRemap, (uint16_t)copy_size);

                Cy_Crypto_Core_V2_poly_1305_calculate(base,  partialMessageRemap, CY_CRYPTO_POLY1305_BLOCK_SIZE);

                size = size - copy_size;
                p_messageRemap += copy_size;
                state->messageIndex = 0u;
            }


            block_count = size / CY_CRYPTO_AES_BLOCK_SIZE;
            Cy_Crypto_Core_V2_poly_1305_calculate(base,  p_messageRemap, block_count * CY_CRYPTO_POLY1305_BLOCK_SIZE);
            p_messageRemap += block_count * CY_CRYPTO_POLY1305_BLOCK_SIZE;

            if ((size % CY_CRYPTO_POLY1305_BLOCK_SIZE) != 0u)
            {
                Cy_Crypto_Core_V2_MemCpy(base, (void*)partialMessageRemap, (void*)p_messageRemap, (uint16_t)(size % CY_CRYPTO_POLY1305_BLOCK_SIZE));
                state->messageIndex += size % CY_CRYPTO_POLY1305_BLOCK_SIZE;
            }

        }

#if (((CY_CPU_CORTEX_M7) && defined (ENABLE_CM7_DATA_CACHE)) || CY_CPU_CORTEX_M55)
        /* Flush the cache */
        SCB_InvalidateDCache_by_Addr((volatile void *)state->partialMessage, (int32_t)CY_CRYPTO_POLY1305_BLOCK_SIZE);
#endif
        Cy_Crypto_Core_V2_poly_1305_store_ctx(base, state);
        tmpResult = CY_CRYPTO_SUCCESS;
    }

    return tmpResult;
}



/*******************************************************************************
* Function Name: Cy_Crypto_Core_poly_1305_Finish
****************************************************************************//**
*
* The function to finish the poly 1305 calculation.
*
* \param base
* The pointer to the CRYPTO instance.
*
* \param state
* The pointer to the poly 1305 state.
*
* \param p_mac
* The pointer to the mac.
*
* \return
* \ref cy_en_crypto_status_t
*******************************************************************************/
cy_en_crypto_status_t Cy_Crypto_Core_poly_1305_Finish(CRYPTO_Type *base, cy_stc_crypto_poly_1305_state_t *state, uint8_t * p_mac)

{

    uint32_t destAddr;
    cy_en_crypto_status_t tmpResult = CY_CRYPTO_BAD_PARAMS;
    uint8_t *p_macRemap;
    uint8_t *partialMessageRemap;

    if ((NULL != state) && (NULL != p_mac))
    {
#if (((CY_CPU_CORTEX_M7) && defined (ENABLE_CM7_DATA_CACHE)) || CY_CPU_CORTEX_M55)
        /* Flush the cache */
        SCB_CleanDCache_by_Addr((volatile void *)state->partialMessage, (int32_t)CY_CRYPTO_POLY1305_BLOCK_SIZE);
#endif
        p_macRemap = (uint8_t *)CY_REMAP_ADDRESS_FOR_CRYPTO(p_mac);
        partialMessageRemap = (uint8_t *)CY_REMAP_ADDRESS_FOR_CRYPTO(&state->partialMessage[0u]);

        tmpResult = Cy_Crypto_Core_V2_poly_1305_load_ctx(base, state);
        if (CY_CRYPTO_SUCCESS != tmpResult)
        {
            return tmpResult;
        }

        if (state->messageIndex < CY_CRYPTO_POLY1305_BLOCK_SIZE)
        {
            Cy_Crypto_Core_V2_poly_1305_calculate(base,  partialMessageRemap,  state->messageIndex);
        }

        CY_CRYPTO_VU_SUB(base, POLY_1305_S_VREG, POLY_1305_S_VREG, POLY_1305_P_VREG);
        CY_CRYPTO_VU_COND_ADD(base, CY_CRYPTO_VU_COND_CC, POLY_1305_S_VREG, POLY_1305_S_VREG, POLY_1305_P_VREG);

        CY_CRYPTO_VU_ADD(base, POLY_1305_S_VREG, POLY_1305_S_VREG, POLY_1305_K_VREG);

        destAddr = (uint32_t)Cy_Crypto_Core_Vu_RegMemPointer(base, POLY_1305_S_VREG);
        Cy_Crypto_Core_V2_FFStart(base, CY_CRYPTO_V2_RB_FF_LOAD0, (uint8_t*)destAddr, CY_CRYPTO_POLY1305_BLOCK_SIZE);
        Cy_Crypto_Core_V2_FFStart(base, CY_CRYPTO_V2_RB_FF_STORE, (uint8_t*)p_macRemap, CY_CRYPTO_POLY1305_BLOCK_SIZE);

        Cy_Crypto_Core_V2_BlockMov(base, CY_CRYPTO_V2_RB_FF_STORE, CY_CRYPTO_V2_RB_FF_LOAD0, CY_CRYPTO_POLY1305_BLOCK_SIZE);
        Cy_Crypto_Core_V2_poly_1305_store_ctx(base, state);

#if (((CY_CPU_CORTEX_M7) && defined (ENABLE_CM7_DATA_CACHE)) || CY_CPU_CORTEX_M55)
        /* Flush the cache */
        SCB_InvalidateDCache_by_Addr((volatile void *)p_mac, (int32_t)CY_CRYPTO_POLY1305_BLOCK_SIZE);
#endif

        tmpResult = CY_CRYPTO_SUCCESS;

