PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_crypto_core_poly1305.c
    }

    return tmpResult;
}


/*******************************************************************************
* Function Name: Cy_Crypto_Core_poly_1305_Free
****************************************************************************//**
*
* The function to free the poly 1305 operation.
*
* \param base
* The pointer to the CRYPTO instance.
*
* \param state
* The pointer to the poly 1305 state.
*
* \return
* \ref cy_en_crypto_status_t
*******************************************************************************/
cy_en_crypto_status_t Cy_Crypto_Core_poly_1305_Free(CRYPTO_Type *base, cy_stc_crypto_poly_1305_state_t *state)

{
    if ((NULL != base) && (NULL != state))
    {
        if (NULL != state->state)
        {
            Cy_Crypto_Core_V2_MemSet(base, (void*)state->state, 0U, (uint16_t)sizeof(cy_stc_crypto_poly_1305_buffers_t));
        }
        Cy_Crypto_Core_V2_MemSet(base, (void*)state, 0U, (uint16_t)sizeof(cy_stc_crypto_poly_1305_state_t));
    }

    return CY_CRYPTO_SUCCESS;
}


/*******************************************************************************
* Function Name: Cy_Crypto_Core_poly_1305_mac
****************************************************************************//**
*
* The function to perform the poly 1305 mac calculation.
*
* \param base
* The pointer to the CRYPTO instance.
*
* \param p_message
* The pointer to the message.
*
* \param size
* The length of the message.
*
*
* \param p_mac
* The pointer to the mac.
*
* \return
* \ref cy_en_crypto_status_t
*******************************************************************************/
cy_en_crypto_status_t Cy_Crypto_Core_poly_1305_mac(CRYPTO_Type *base, uint8_t const *key, uint8_t const * p_message, uint32_t size,  uint8_t * p_mac)

{
    cy_en_crypto_status_t status = CY_CRYPTO_BAD_PARAMS;
    uint8_t state_t[CY_CRYPTO_ALIGN_CACHE_LINE(sizeof(cy_stc_crypto_poly_1305_state_t)) + CY_CRYPTO_DCAHCE_PADDING_SIZE];
    uint8_t buffer_t[CY_CRYPTO_ALIGN_CACHE_LINE(sizeof(cy_stc_crypto_poly_1305_buffers_t)) + CY_CRYPTO_DCAHCE_PADDING_SIZE];

    /* Input parameters verification */
    if ((NULL == base) || (NULL == key) || ((NULL == p_message) && (size > 0u))
            || (NULL == p_mac))
    {
        return status;
    }

    cy_stc_crypto_poly_1305_state_t *state = (cy_stc_crypto_poly_1305_state_t *)CY_CRYPTO_DCACHE_ALIGN_ADDRESS(state_t);
    cy_stc_crypto_poly_1305_buffers_t *buffer = (cy_stc_crypto_poly_1305_buffers_t *)CY_CRYPTO_DCACHE_ALIGN_ADDRESS(buffer_t);

    Cy_Crypto_Core_V2_MemSet(base, state, 0u, (uint16_t)sizeof(cy_stc_crypto_poly_1305_state_t));
    Cy_Crypto_Core_V2_MemSet(base, buffer, 0u, (uint16_t)sizeof(cy_stc_crypto_poly_1305_buffers_t));

    status = Cy_Crypto_Core_poly_1305_Init(base, key, state, buffer);

    if (CY_CRYPTO_SUCCESS == status)
    {

        status = Cy_Crypto_Core_poly_1305_Update(base, state, p_message, size);

    }

    if (CY_CRYPTO_SUCCESS == status)
    {

        status = Cy_Crypto_Core_poly_1305_Finish(base, state, p_mac);
    }

    if (CY_CRYPTO_SUCCESS == status)
    {

        status = Cy_Crypto_Core_poly_1305_Free(base, state);
    }


    return status;
}


#endif /* #if (CPUSS_CRYPTO_VU == 1)  && (CY_CRYPTO_CFG_POLY1305_ENABLED == 1)*/

#if defined(__cplusplus)
}
#endif

#endif /* CY_IP_MXCRYPTO */


/* [] END OF FILE */
